Tekla.Structures.Drawing.Grid.GridTextPlacement
The different placing options for the Text labels on a Grid.
Use OR operator (|) to combine more than one option.
Ex. GridBottom | GridLeft, to show Text labels on both left and bottom of grid.
TextPosition =      (GridLine.GridLineTextPlacement.OnlyText |
GridLine.GridLineTextPlacement.GridBottom |
GridLine.GridLineTextPlacement.GridRight |
GridLine.GridLineTextPlacement.GridTop |
GridLine.GridLineTextPlacement.GridLeft);
The above code makes the gridlines invisible but shows all the text labels of the grid.

Tekla.Structures.Drawing.Grid.GridTextPlacement.GridBottom
Text label shown on bottom of Grid

Tekla.Structures.Drawing.Grid.GridTextPlacement.GridLeft
Text label shown on left of Grid

Tekla.Structures.Drawing.Grid.GridTextPlacement.GridTop
Text label shown on top of Grid

Tekla.Structures.Drawing.Grid.GridTextPlacement.GridRight
Text label shown on right of Grid

Tekla.Structures.Drawing.Grid.GridTextPlacement.OnlyText
Only Text shown on Grid, no lines are drawn.